In [1]:
#series addition,sub,mul,division
import pandas as pd
s1=pd.Series([2,4,6,8,10])
s2=pd.Series([1,3,5,7,9])
print(s1+s2)
print(s1-s2)
print(s1*s2)
print(s1/s2)

0     3
1     7
2    11
3    15
4    19
dtype: int64
0    1
1    1
2    1
3    1
4    1
dtype: int64
0     2
1    12
2    30
3    56
4    90
dtype: int64
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [8]:
#minimum maximum median 25th and 75th percentile
import numpy as np
a= np.random.RandomState(100)
series1 = pd.Series(a.normal(10, 4, 30))
print(series1)
result = np.percentile(series1, q=[0, 25, 50, 75, 100])
print("\nminimum, 25th percentile, median, 75th, and maximum of a given series:")
print(result)

0      3.000938
1     11.370722
2     14.612143
3      8.990256
4     13.925283
5     12.056875
6     10.884719
7      5.719827
8      9.242017
9     11.020006
10     8.167892
11    11.740654
12     7.665620
13    13.267388
14    12.690883
15     9.582355
16     7.874878
17    14.118931
18     8.247458
19     5.526727
20    16.475927
21    16.166421
22     8.992483
23     6.630257
24    10.738075
25    13.748329
26    12.924001
27    15.446225
28     8.695048
29    10.222704
dtype: float64

minimum, 25th percentile, median, 75th, and maximum of a given series:
[ 3.00093811  8.35935507 10.81139672 13.18154156 16.47592664]

In [10]:
#Pandas program of a given series not present in another given series.
series2 = pd.Series([1, 3, 5, 6, 7])
series3 = pd.Series([11, 6, 4, 1, 19])
print(series2)
print(series3)
res = series2[~series2.isin(series3)]
print(res)

0    1
1    3
2    5
3    6
4    7
dtype: int64
0    11
1     6
2     4
3     1
4    19
dtype: int64
1    3
2    5
4    7
dtype: int64

In [12]:
#Pandas program to filter words from a given series that contain at least two vowels. 
from collections import Counter
series4 = pd.Series(['Age','Sin','Can','wait','Water','Pay'])
print(series4)
res = mask =series4.map(lambda c: sum([Counter(c.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
print(series4[res])

0      Age
1      Sin
2      Can
3     wait
4    Water
5      Pay
dtype: object
0      Age
3     wait
4    Water
dtype: object

In [14]:
#Consider a DataFrame,Pandas program to select the rows where the number of attempts in the examination is greater than 2.
dict1={'name':['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas']
     ,'score':[12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],'attempts':[1, 3, 2, 3, 2, 3, 1, 1, 2, 1]
     ,'qualify':['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
a=['i','ii','iii','iv','v','vi','vii','viii','ix','x']
df=pd.DataFrame(dict1,index=a)

In [15]:
df

           name  score  attempts qualify
i     Anastasia   12.5         1     yes
ii         Dima    9.0         3      no
iii   Katherine   16.5         2     yes
iv        James    NaN         3      no
v         Emily    9.0         2      no
vi      Michael   20.0         3     yes
vii     Matthew   14.5         1     yes
viii      Laura    NaN         1      no
ix        Kevin    8.0         2      no
x         Jonas   19.0         1     yes

In [18]:
df[df['attempts']>2]

       name  score  attempts qualify
ii     Dima    9.0         3      no
iv    James    NaN         3      no
vi  Michael   20.0         3     yes